##### Original Questions can be found in the following link 
https://8weeksqlchallenge.com/case-study-1/


__Introduction__
Danny seriously loves Japanese food so in the beginning of 2021, he decides to embark upon a risky venture and opens up a cute little restaurant that sells his 3 favourite foods: sushi, curry and ramen.

Danny’s Diner is in need of your assistance to help the restaurant stay afloat - the restaurant has captured some very basic data from their few months of operation but have no idea how to use their data to help them run the business.

__Problem Statement__
Danny wants to use the data to answer a few simple questions about his customers, especially about their visiting patterns, how much money they’ve spent and also which menu items are their favourite. Having this deeper connection with his customers will help him deliver a better and more personalised experience for his loyal customers.

He plans on using these insights to help him decide whether he should expand the existing customer loyalty program - additionally he needs help to generate some basic datasets so his team can easily inspect the data without needing to use SQL.

Danny has provided you with a sample of his overall customer data due to privacy issues - but he hopes that these examples are enough for you to write fully functioning SQL queries to help him answer his questions!

In [ ]:
## The following tables are created in Postgresql server

CREATE TABLE sales (
  "customer_id" CHARACTER VARYING (1),
  "order_date" DATE,
  "product_id" INTEGER
);

CREATE TABLE sales (
  "customer_id" VARCHAR(1),
  "order_date" DATE,
  "product_id" INTEGER
);

INSERT INTO sales
  ("customer_id", "order_date", "product_id")
VALUES
  ('A', '2021-01-01', '1'),
  ('A', '2021-01-01', '2'),
  ('A', '2021-01-07', '2'),
  ('A', '2021-01-10', '3'),
  ('A', '2021-01-11', '3'),
  ('A', '2021-01-11', '3'),
  ('B', '2021-01-01', '2'),
  ('B', '2021-01-02', '2'),
  ('B', '2021-01-04', '1'),
  ('B', '2021-01-11', '1'),
  ('B', '2021-01-16', '3'),
  ('B', '2021-02-01', '3'),
  ('C', '2021-01-01', '3'),
  ('C', '2021-01-01', '3'),
  ('C', '2021-01-07', '3');
 

CREATE TABLE menu (
  "product_id" INTEGER,
  "product_name" VARCHAR(5),
  "price" INTEGER
);

INSERT INTO menu
  ("product_id", "product_name", "price")
VALUES
  ('1', 'sushi', '10'),
  ('2', 'curry', '15'),
  ('3', 'ramen', '12');
  

CREATE TABLE members (
  "customer_id" VARCHAR(1),
  "join_date" DATE
);

INSERT INTO members
  ("customer_id", "join_date")
VALUES
  ('A', '2021-01-07'),
  ('B', '2021-01-09');

##### Q1: What is the total amount each customer spent at the restaurant?

In [23]:
%%sql 

select s.customer_id, sum(m.price) from sales s, menu m 
where s.product_id = m.product_id 
group by 1 order by 1;

 * postgresql://postgres:***@localhost:5432/SQL_Challenge_Danny
3 rows affected.

[('A', 76), ('B', 74), ('C', 36)]

#### Q2: How many days has each customer visited the restaurant?

In [24]:
%%sql 

select customer_id, count(distinct order_date) from sales 
group by 1 order by 1;

 * postgresql://postgres:***@localhost:5432/SQL_Challenge_Danny
3 rows affected.

[('A', 4), ('B', 6), ('C', 2)]

#### Q3: What was the first item from the menu purchased by each customer?

In [37]:
%%sql 

WITH PG_RNK AS
    (
    select s.customer_id, m.product_name, row_number() over(partition by s.customer_id order by s.order_date) As Rnk 
    from sales s, menu m where s.product_id=m.product_id
    )

select customer_id, product_name from PG_RNK where Rnk=1

 * postgresql://postgres:***@localhost:5432/SQL_Challenge_Danny
3 rows affected.

[('A', 'curry'), ('B', 'curry'), ('C', 'ramen')]

#### Q4: What is the most purchased item on the menu and how many times was it purchased by all customers?

In [45]:
%%sql


select s.customer_id, m.product_name, count(s.product_id) from sales s, menu m
where s.product_id = m.product_id 
and s.product_id = 

(select SS.product_id from (select product_id, count(product_id) from sales group by 1 order by 2 desc limit 1)SS)
group by 1,2 order by 1;

 * postgresql://postgres:***@localhost:5432/SQL_Challenge_Danny
3 rows affected.

[('A', 'ramen', 3), ('B', 'ramen', 2), ('C', 'ramen', 3)]

##### Q5: Which item was the most popular for each customer?

In [53]:
%%sql

    
select tbl.customer_id, tbl.product_name, tbl.PurchasedProduct from 
    (select s.customer_id, m.product_name, count(s.product_id) As PurchasedProduct, 
    rank() over(partition by s.customer_id order by count(s.product_id) DESC) As Rnk 
    from sales s, menu m
    where s.product_id = m.product_id 
    group by 1,2 order by 1) As tbl
where tbl.Rnk =1;

 * postgresql://postgres:***@localhost:5432/SQL_Challenge_Danny
5 rows affected.

[('A', 'ramen', 3),
 ('B', 'sushi', 2),
 ('B', 'curry', 2),
 ('B', 'ramen', 2),
 ('C', 'ramen', 3)]

##### Q6: Which item was purchased first by the customer after they became a member?

In [71]:
%%sql
    
WITH tbl as (   
select c.customer_id, c.order_date, c.product_id, p.product_name,  m.join_date, 
CASE WHEN c.order_date >= m.join_date THEN 'YES'
ELSE 'NO'
END AS Order_After_join
from sales c, members m, menu p
where c.customer_id = m.customer_id AND c.product_id = p.product_id 
)

select * from (
select customer_id, product_name,order_date,join_date,  rank() over(partition by customer_id order by order_date) As Rnk
from tbl where order_after_join = 'YES') A where A.Rnk=1 
;

 * postgresql://postgres:***@localhost:5432/SQL_Challenge_Danny
2 rows affected.

[('A', 'curry', datetime.date(2021, 1, 7), datetime.date(2021, 1, 7), 1),
 ('B', 'sushi', datetime.date(2021, 1, 11), datetime.date(2021, 1, 9), 1)]

In [73]:
%%sql

-- ## previosu question can be solved by unsing nested CTE rather than nested subqueries

WITH tbl as (   
                select c.customer_id, c.order_date, c.product_id, p.product_name,  m.join_date, 
                CASE WHEN c.order_date >= m.join_date THEN 'YES'
                ELSE 'NO'
                END AS Order_After_join
                from sales c, members m, menu p
                where c.customer_id = m.customer_id AND c.product_id = p.product_id 
            ),

tbl2 as (
            select customer_id, product_name,order_date,join_date,  
            rank() over(partition by customer_id order by order_date) As Rnk
            from tbl where order_after_join = 'YES'
        )

select customer_id, product_name, order_date, join_date from tbl2 where rnk=1;

 * postgresql://postgres:***@localhost:5432/SQL_Challenge_Danny
2 rows affected.

[('A', 'curry', datetime.date(2021, 1, 7), datetime.date(2021, 1, 7)),
 ('B', 'sushi', datetime.date(2021, 1, 11), datetime.date(2021, 1, 9))]

##### Q7. Which item was purchased just before the customer became a member?

In [74]:
%%sql

WITH tbl as (   
                select c.customer_id, c.order_date, c.product_id, p.product_name,  m.join_date, 
                CASE WHEN c.order_date >= m.join_date THEN 'YES'
                ELSE 'NO'
                END AS Order_After_join
                from sales c, members m, menu p
                where c.customer_id = m.customer_id AND c.product_id = p.product_id 
            ),

tbl2 as (
            select customer_id, product_name,order_date,join_date,  
            rank() over(partition by customer_id order by order_date DESC) As Rnk
            from tbl where order_after_join = 'NO'
        )

select customer_id, product_name, order_date, join_date from tbl2 where rnk=1;

 * postgresql://postgres:***@localhost:5432/SQL_Challenge_Danny
3 rows affected.

[('A', 'sushi', datetime.date(2021, 1, 1), datetime.date(2021, 1, 7)),
 ('A', 'curry', datetime.date(2021, 1, 1), datetime.date(2021, 1, 7)),
 ('B', 'sushi', datetime.date(2021, 1, 4), datetime.date(2021, 1, 9))]

##### Q8. What is the total items and amount spent for each member before they became a member?

In [78]:
%%sql

WITH tbl as (   
                select c.customer_id, c.order_date, c.product_id, p.product_name, p.price, m.join_date, 
                CASE WHEN c.order_date >= m.join_date THEN 'YES'
                ELSE 'NO'
                END AS Order_After_join
                from sales c, members m, menu p
                where c.customer_id = m.customer_id AND c.product_id = p.product_id 
            )

select customer_id, count(product_name) As "Total Items", sum(price) As "Total Spent" from tbl where Order_After_join= 'NO'
group by customer_id
order by 1,2 ;

 * postgresql://postgres:***@localhost:5432/SQL_Challenge_Danny
2 rows affected.

[('A', 2, 25), ('B', 3, 40)]

##### Q9. If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?

In [84]:
%%sql

WITH Reward_Point As (
                        select c.customer_id, p.product_name, p.price,
                        CASE WHEN UPPER(p.product_name) = 'SUSHI' THEN 2*10*p.price
                             ELSE 10*p.price
                        END AS "Rewards"
                        from sales c, menu p
                        where c.product_id = p.product_id 
                    )
select customer_id, sum("Rewards") from Reward_point group by 1 order by 1;

 * postgresql://postgres:***@localhost:5432/SQL_Challenge_Danny
3 rows affected.

[('A', 860), ('B', 940), ('C', 360)]

##### Q10. In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many   points do customer A and B have at the end of January?

In [99]:
%%sql
WITH Member_Order AS (
                        select c.customer_id, c.order_date, m.join_date, c.product_id,
                        CASE WHEN c.order_date >= m.join_date THEN 'YES'
                             ELSE 'NO'
                        END AS post_membership
                        from sales c, members m
                        where c.customer_id = m.customer_id 
                    ),
Reward_Point As (
                    select mo.customer_id, p.product_name, p.price, mo.order_date, m.join_date,
                    CASE WHEN UPPER(p.product_name) = 'SUSHI' THEN 2*10*p.price
                    WHEN mo.order_date >= m.join_date AND mo.order_date <= m.join_date+ interval '7 day' THEN 2*10*p.price
                    ELSE 10*p.price
                    END AS "Rewards"
                    from Member_Order mo, menu p, members m
                    where mo.product_id = p.product_id and mo.customer_id = m.customer_id and mo.post_membership='YES' 
                )
    
select customer_id, sum("Rewards") from Reward_Point where order_date < '2021-02-01'
group by 1 order by 1

 * postgresql://postgres:***@localhost:5432/SQL_Challenge_Danny
2 rows affected.

[('A', 1020), ('B', 440)]

#### Bonus Question
please check the link to the question https://8weeksqlchallenge.com/case-study-1/

In [109]:
%%sql
 -- ## Bonus Q 1
select c.customer_id, c.order_date, p.product_name, p.price,
CASE WHEN c.order_date >= m.join_date THEN 'Y'
ELSE 'N'
END as member
 from sales c left join members m ON c.customer_id = m.customer_id 
                    join menu p ON  c.product_id = p.product_id

 * postgresql://postgres:***@localhost:5432/SQL_Challenge_Danny
15 rows affected.

[('A', datetime.date(2021, 1, 7), 'curry', 15, 'Y'),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y'),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y'),
 ('A', datetime.date(2021, 1, 10), 'ramen', 12, 'Y'),
 ('A', datetime.date(2021, 1, 1), 'sushi', 10, 'N'),
 ('A', datetime.date(2021, 1, 1), 'curry', 15, 'N'),
 ('B', datetime.date(2021, 1, 4), 'sushi', 10, 'N'),
 ('B', datetime.date(2021, 1, 11), 'sushi', 10, 'Y'),
 ('B', datetime.date(2021, 1, 1), 'curry', 15, 'N'),
 ('B', datetime.date(2021, 1, 2), 'curry', 15, 'N'),
 ('B', datetime.date(2021, 1, 16), 'ramen', 12, 'Y'),
 ('B', datetime.date(2021, 2, 1), 'ramen', 12, 'Y'),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N'),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N'),
 ('C', datetime.date(2021, 1, 7), 'ramen', 12, 'N')]

In [110]:
%%sql

WITH final_table AS (
                    select c.customer_id, c.order_date, p.product_name, p.price,
                    CASE WHEN c.order_date >= m.join_date THEN 'Y'
                    ELSE 'N'
                    END as member
                    from sales c left join members m ON c.customer_id = m.customer_id 
                    join menu p ON  c.product_id = p.product_id 
                    ),

result_table AS (
                    select customer_id, order_date, product_name, price, member
                    , rank() over(partition by customer_id order by order_date) as ranking 
                    from final_table where member = 'Y'

                    UNION

                    select customer_id, order_date, product_name, price, member
                    , NULL as ranking 
                    from final_table where member = 'N'
                )

select * from result_table order by 1,2;

 * postgresql://postgres:***@localhost:5432/SQL_Challenge_Danny
13 rows affected.

[('A', datetime.date(2021, 1, 1), 'sushi', 10, 'N', None),
 ('A', datetime.date(2021, 1, 1), 'curry', 15, 'N', None),
 ('A', datetime.date(2021, 1, 7), 'curry', 15, 'Y', 1),
 ('A', datetime.date(2021, 1, 10), 'ramen', 12, 'Y', 2),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y', 3),
 ('B', datetime.date(2021, 1, 1), 'curry', 15, 'N', None),
 ('B', datetime.date(2021, 1, 2), 'curry', 15, 'N', None),
 ('B', datetime.date(2021, 1, 4), 'sushi', 10, 'N', None),
 ('B', datetime.date(2021, 1, 11), 'sushi', 10, 'Y', 1),
 ('B', datetime.date(2021, 1, 16), 'ramen', 12, 'Y', 2),
 ('B', datetime.date(2021, 2, 1), 'ramen', 12, 'Y', 3),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N', None),
 ('C', datetime.date(2021, 1, 7), 'ramen', 12, 'N', None)]